docs/measurements/raw/before-maxprice-k6-warm-summary.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: scripts/k6/list-api-perf-maxprice.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 10 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 10 VUs  00.9s/30s

running (0m02.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   6% ] 10 VUs  01.9s/30s

running (0m03.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  02.9s/30s

running (0m04.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [  13% ] 10 VUs  03.9s/30s

running (0m05.0s), 10/10 VUs, 11 complete and 0 interrupted iterations
default   [  16% ] 10 VUs  04.9s/30s

running (0m06.0s), 10/10 VUs, 21 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  05.9s/30s

running (0m07.0s), 10/10 VUs, 21 complete and 0 interrupted iterations
default   [  23% ] 10 VUs  06.9s/30s

running (0m08.0s), 10/10 VUs, 21 complete and 0 interrupted iterations
default   [  26% ] 10 VUs  07.9s/30s

running (0m09.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  08.9s/30s

running (0m10.0s), 10/10 VUs, 31 complete and 0 interrupted iterations
default   [  33% ] 10 VUs  09.9s/30s

running (0m11.0s), 10/10 VUs, 32 complete and 0 interrupted iterations
default   [  36% ] 10 VUs  10.9s/30s

running (0m12.0s), 10/10 VUs, 41 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  11.9s/30s

running (0m13.0s), 10/10 VUs, 42 complete and 0 interrupted iterations
default   [  43% ] 10 VUs  12.9s/30s

running (0m14.0s), 10/10 VUs, 45 complete and 0 interrupted iterations
default   [  46% ] 10 VUs  13.9s/30s

running (0m15.0s), 10/10 VUs, 52 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  14.9s/30s

running (0m16.0s), 10/10 VUs, 53 complete and 0 interrupted iterations
default   [  53% ] 10 VUs  15.9s/30s

running (0m17.0s), 10/10 VUs, 61 complete and 0 interrupted iterations
default   [  56% ] 10 VUs  16.9s/30s

running (0m18.0s), 10/10 VUs, 63 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  17.9s/30s

running (0m19.0s), 10/10 VUs, 64 complete and 0 interrupted iterations
default   [  63% ] 10 VUs  18.9s/30s

running (0m20.0s), 10/10 VUs, 72 complete and 0 interrupted iterations
default   [  66% ] 10 VUs  19.9s/30s

running (0m21.0s), 10/10 VUs, 73 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  20.9s/30s

running (0m22.0s), 10/10 VUs, 78 complete and 0 interrupted iterations
default   [  73% ] 10 VUs  21.9s/30s

running (0m23.0s), 10/10 VUs, 83 complete and 0 interrupted iterations
default   [  76% ] 10 VUs  22.9s/30s

running (0m24.0s), 10/10 VUs, 85 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  23.9s/30s

running (0m25.0s), 10/10 VUs, 92 complete and 0 interrupted iterations
default   [  83% ] 10 VUs  24.9s/30s

running (0m26.0s), 10/10 VUs, 94 complete and 0 interrupted iterations
default   [  86% ] 10 VUs  25.9s/30s

running (0m27.0s), 10/10 VUs, 95 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  26.9s/30s

running (0m28.0s), 10/10 VUs, 104 complete and 0 interrupted iterations
default   [  93% ] 10 VUs  27.9s/30s

running (0m29.0s), 10/10 VUs, 104 complete and 0 interrupted iterations
default   [  96% ] 10 VUs  28.9s/30s

running (0m30.0s), 10/10 VUs, 110 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  29.9s/30s

running (0m31.0s), 07/10 VUs, 114 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  30s


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate==0' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 121     3.784764/s
    checks_succeeded...: 100.00% 121 out of 121
    checks_failed......: 0.00%   0 out of 121

    ✓ status 200

    HTTP
    http_req_duration..............: avg=2.46s min=0.07s med=2.56s max=3.43s p(90)=2.71s p(95)=2.75s
      { expected_response:true }...: avg=2.46s min=0.07s med=2.56s max=3.43s p(90)=2.71s p(95)=2.75s
    http_req_failed................: 0.00%  0 out of 122
    http_reqs......................: 122    3.816043/s

    EXECUTION
    iteration_duration.............: avg=2.58s min=0.82s med=2.66s max=3.53s p(90)=2.81s p(95)=2.85s
    iterations.....................: 121    3.784764/s
    vus............................: 7      min=7        max=10
    vus_max........................: 10     min=10       max=10

    NETWORK
    data_received..................: 5.6 GB 174 MB/s
    data_sent......................: 42 kB  1.3 kB/s



running (0m32.0s), 00/10 VUs, 121 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  30s