docs/measurements/raw/nb1-baseline-na2-k6-cold.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: scripts/k6/list-api-perf-maxprice.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 10 looping VUs for 30s (gracefulStop: 30s)



  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate==0' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 1265    41.759367/s
    checks_succeeded...: 100.00% 1265 out of 1265
    checks_failed......: 0.00%   0 out of 1265

    ✓ status 200

    HTTP
    http_req_duration..............: avg=137.27ms min=58.93ms med=133.1ms  max=327.44ms p(90)=177.11ms p(95)=200.32ms
      { expected_response:true }...: avg=137.27ms min=58.93ms med=133.1ms  max=327.44ms p(90)=177.11ms p(95)=200.32ms
    http_req_failed................: 0.00%  0 out of 1266
    http_reqs......................: 1266   41.792378/s

    EXECUTION
    iteration_duration.............: avg=237.91ms min=159.2ms med=233.52ms max=429.65ms p(90)=278.27ms p(95)=300.6ms 
    iterations.....................: 1265   41.759367/s
    vus............................: 10     min=10        max=10
    vus_max........................: 10     min=10        max=10

    NETWORK
    data_received..................: 5.2 GB 171 MB/s
    data_sent......................: 438 kB 15 kB/s



default ✓ [ 100% ] 10 VUs  30s